[{"task": "Create a plan for a large one-room apartment. There should be a large kitchen and a large living room. Make the kitchen next to the hallway. There should be no wall between the hallway and the corridor.", "actions": "1. Hallway: First of all, you must design the hallway, which will be located at the entrance to the apartment. You must make it 2 x 2.5 meters in size, so that there is enough space for a comfortable entrance to the apartment.\n2. Kitchen location: Since the task requires the kitchen to be adjacent to the hallway without a wall between the hallway and corridor, you must place the kitchen at the left of the hallway with a door between them.\n3. Kitchen size: Based on the requirement of 8 m2 for the kitchen area, you must allocate a space of 8 m2 for a functional and adequately-equipped kitchen. This will include the necessary plumbing and electrical installations for sink, stove, and appliances.\n4. Living area: Following the requirements, you must designate a separate open space for the living room. Given the total apartment area of 38 m2, and with 8 m2 already allocated for the kitchen, you must assign at least 14 m2 for the living area. This room can also function as a bedroom.\n5. Bathroom size: The minimum area required for a bathroom in a state-funded building is 3 m2. You must allocate 5 m2 for the bathroom, combining it with a toilet and a sink. To adhere to the task's requirement of a combined bathroom, a shower or bathtub will also be added to this area.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room lobby = new Room(name: \"Lobby\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2500), new Vector2(2000, 2500), new Vector2(2000, 0)});\n    lobby.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(2000, 0), doorRelativePosition: 0.5);\n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(-4000, 0), new Vector2(-4000, 2500), new Vector2(0, 2500), new Vector2(0, 0)});\n    kitchen.ConnectTo(roomToConnect: lobby, withWall: true, addDoor: true);\n    \n    Room coridor = new Room(name: \"Corridor\", contourPoints: new List<Vector2>() { new Vector2(0, 2500), new Vector2(0, 6500), new Vector2(2000, 6500), new Vector2(2000, 2500)});\n    coridor.ConnectTo(roomToConnect: lobby, withWall: false);\n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(-4000, 2500), new Vector2(-4000, 6500), new Vector2(0, 6500), new Vector2(0, 2500)});\n    coridor.ConnectTo(roomToConnect: livingRoom, withWall: true, addDoor: true);\n    Room bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(2000, 3500), new Vector2(2000, 6500), new Vector2(4000, 6500), new Vector2(4000, 3500)});\n    coridor.ConnectTo(roomToConnect: bathroom, withWall: true, addDoor: true);\n    Flat flat = new Flat(new List<Room> { lobby, kitchen, bathroom, coridor, livingRoom });\n    return flat;\n}\n```"}, {"task": "Make a three-room apartment. It should have a bathroom, toilet, two bedrooms and a large combined kitchen-dining room.", "actions": "1. Plan the lobby and the corridor: You must place a small lobby (2-4 sq.m) near the entrance, providing a space to remove shoes and coats. A corridor connecting the rooms, if necessary, will be kept to a minimum width to preserve overall living space. Built-in wardrobes or closets will be added to the hallway or bedrooms to provide additional storage.\n2. Plan the bathroom and the toilet: You must place the bathroom and toilet in the most appropriate locations, which are usually near the kitchen or in the center of the apartment to facilitate plumbing installation. You must ensure these rooms are well-ventilated and have enough space for the necessary fixtures (sink, shower/bathtub, toilet). You must the dimensions of the bathroom to be 2.5 x 3.5 meters, and the dimensions of the toilet to be 2.5 x 1.5 meters.\n3. Plan the bedrooms: You must place two bedrooms adjacent to each other or opposite the bathroom, providing privacy and accessibility. Each bedroom must have a minimum size of 10 sq.m per person, ensuring enough space for a double bed, closet, and a small desk or seating area. By designing non-through bedrooms, you must maximize the use of space and create a more intimate and quiet atmosphere. In order to meet all requirements, you must accept two bedrooms measuring 3.5 x 5 meters.\n4. Plan the kitchen-dining room: The combined kitchen-dining room must be the largest space in the apartment, taking up at least 20 sq.m. You must design it as an open space, promoting social interaction and making the apartment feel larger, so it will be connected by a single space with the corridor. The kitchen area will include a sink, stove, refrigerator, and cabinets. The dining area will have a table and chairs for 4-6 people, providing ample space for meals and gatherings. Finally, you must accept the kitchen-dining room 4 x 9 meters in size.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n\tRoom lobby = new Room(name: \"Lobby\", contourPoints: new List<Vector2>() { new Vector2(-5000, 0), new Vector2(-5000, 4000), new Vector2(-3000, 4000), new Vector2(-3000, 0) });\n    lobby.AddDoorBetween(firstPoint: new Vector2(-5000, 0), secondPoint: new Vector2(-3000, 0), doorRelativePosition: 0.5);\n    Room coridor = new Room(name: \"Corridor\", contourPoints: new List<Vector2>() { new Vector2(-3000, 2500), new Vector2(-3000, 4000), new Vector2(2000, 4000), new Vector2(2000, 2500) });\n    coridor.ConnectTo(roomToConnect: lobby, withWall: false);\n    \n    Room bathroom = new Room(name: \"Bathroom\", contourPoints: new List<Vector2>() { new Vector2(-3000, 0), new Vector2(-3000, 2500), new Vector2(500, 2500), new Vector2(500, 0) });\n    Room toilet = new Room(name: \"Toilet\", contourPoints: new List<Vector2>() { new Vector2(500, 0), new Vector2(500, 2500), new Vector2(2000, 2500), new Vector2(2000, 0) });\n    coridor.ConnectTo(roomToConnect: bathroom, withWall: true, addDoor: true);\n    coridor.ConnectTo(roomToConnect: toilet, withWall: true, addDoor: true);\n\n    Room firstBedroom = new Room(name: \"First bedroom\", contourPoints: new List<Vector2>() { new Vector2(-5000, 4000), new Vector2(-5000, 9000), new Vector2(-1500, 9000), new Vector2(-1500, 4000) });\n    coridor.ConnectTo(roomToConnect: firstBedroom, withWall: true, addDoor: true);\n    Room secondBedroom = new Room(name: \"Second bedroom\", contourPoints: new List<Vector2>() { new Vector2(-1500, 4000), new Vector2(-1500, 9000), new Vector2(2000, 9000), new Vector2(2000, 4000) });\n    coridor.ConnectTo(roomToConnect: secondBedroom, withWall: true, addDoor: true);\n    \n    Room diningRoom = new Room(name: \"Dining room\", contourPoints: new List<Vector2>() { new Vector2(2000, 0), new Vector2(2000, 9000), new Vector2(6000, 9000), new Vector2(6000, 0) });\n    coridor.ConnectTo(roomToConnect: diningRoom, withWall: false);\n\n    Flat flat = new Flat(new List<Room> { lobby, coridor, bathroom, toilet, firstBedroom, secondBedroom, diningRoom });\n    return flat;\n}\n```"}, {"task": "Make a small studio apartment. It should only have a hallway and a living room, there should be no wall between them.", "actions": "1. Design the lobby and living room: since the recommended area of ​​a one-room apartment is from 28 to 38 m2, so take the total area of ​​the apartment as 30 m2. You must allocate a space of 4 m2 for a hallway, making it 2 x 2 meters in size, which should be sufficient for a comfortable entrance to the apartment. According to the requirements, the minimum size of a living room is 14 m, so allocate 16 m for the living room, which will also serve as the bedroom in this studio apartment.\n2. Design the kitchen: Based on the requirement of 8 m2 for the kitchen area, you must allocate a space of 8 m2 for the kitchen. This will include the necessary plumbing and electrical installations for a sink, stove, and appliances. Although it is smaller than recommended, this area should still allow for a functional kitchen.\n3. Design the bathroom: You should make a combined bathroom with an area of ​​4 m2 in order to allocate enough space for a bathtub and toilet. To adhere to the task's requirement of a combined bathroom, a shower or bathtub will also be added to this area.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room lobby = new Room(name: \"Lobby\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2000), new Vector2(2000, 2000), new Vector2(2000, 0) });\n    lobby.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(2000, 0), doorRelativePosition: 0.5);\n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(-2000, 2000), new Vector2(-2000, 6000), new Vector2(2000, 6000), new Vector2(2000, 2000) });\n    livingRoom.ConnectTo(roomToConnect: lobby, withWall: false);\n    \n\tRoom kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(2000, 2000), new Vector2(2000, 6000), new Vector2(4000, 6000), new Vector2(4000, 2000) });\n    kitchen.ConnectTo(roomToConnect: livingRoom, withWall: false);\n    \n    Room bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(2000, 0), new Vector2(2000, 2000), new Vector2(4000, 2000), new Vector2(4000, 0) });\n    bathroom.ConnectTo(roomToConnect: lobby, withWall: true, addDoor: true);\n    \n    Flat flat = new Flat(new List<Room> { lobby, livingRoom, kitchen, bathroom });\n    return flat;\n}\n```"}, {"task": "Make a two-room apartment with a living room and a bedroom. The apartment should start with a hallway, immediately after it there should be a corridor. The corridor should be long and L-shaped, through it there should be access to all the other rooms. The toilet, bathroom and the bedroom should be at the end of the corridor.", "actions": "1. Plan the lobby: You must design a lobby near the entrance that is 2 x 2 meters in size, making it spacious enough for easy access and movement within the apartment.\n2. Plan the corridor: After the lobby, you must design a long, L-shape corridor which will serve as the main connection to all rooms. The corridor must be 1.5 meters wide, allowing sufficient space for comfortable movement and access to all the other rooms. It must consist of two rectangles, first of which will be 6.5 meters long and the second is 3.5 meters.\n3. Plan the kitchen: You must allocate enough space for a kitchen along the corridor near the hallway. Based on the requirement of at least 8 m2 for the kitchen area, you must create a rectangular kitchen with a length of 4.75 m and a width of 2.75 m.\n4. Plan the living room: The living room will be located along the corridor near the kitchen. You must make the living room the largest space in the apartment, ensuring dimensions of at least 16 m2 to meet the requirements for a two-room apartment. A width of 3.75 meters and a length of 4.75 meters will provide an area of 17.8 sq. m for the living room.\n5. Plan the bathroom and toilet: At the turn of the corridor, you must allocate space for a bathroom and a separate toilet, ensuring they are well-ventilated and have enough space for necessary fixtures. The bathroom dimensions must be 2.25 x 2 meters, while the toilet dimensions must be 2.25 x 1.5 meters.\n6. Plan the bedroom: At the end of the corridor, the bedroom must be placed, also adhering to the requirement of at least 8 m2 for one person and at left 10 m2 for two persons. For a two-room apartment, a minimum size of 10 m2 can be considered appropriate. You must create a bedroom 3.75 meters long and 2.75 meters wide, so the area of the bedroom is 10.3 square meters.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room lobby = new Room(name: \"Lobby\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2000), new Vector2(2000, 2000), new Vector2(2000, 0) });\n    lobby.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(2000, 0), doorRelativePosition: 0.5);\n    \n    Room coridor = new Room(name: \"Corridor\", contourPoints: new List<Vector2>() { new Vector2(-6000, 2000), new Vector2(-6000, 5500), new Vector2(-4500, 5500), new Vector2(-4500, 3500), new Vector2(2000, 3500), new Vector2(2000, 2000) });\n    coridor.ConnectTo(roomToConnect: lobby, withWall: false);\n    \n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(-750, 3500), new Vector2(-750, 8250), new Vector2(2000, 8250), new Vector2(2000, 3500) });\n    coridor.ConnectTo(roomToConnect: kitchen, withWall: true, addDoor: true);\n    \n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(-4500, 3500), new Vector2(-4500, 8250), new Vector2(-750, 8250), new Vector2(-750, 3500) });\n    coridor.ConnectTo(roomToConnect: livingRoom, withWall: true, addDoor: true);\n    \n    Room bathroom = new Room(name: \"Bathroom\", contourPoints: new List<Vector2>() { new Vector2(-8250, 2000), new Vector2(-8250, 4000), new Vector2(-6000, 4000), new Vector2(-6000, 2000) });\n    coridor.ConnectTo(roomToConnect: bathroom, withWall: true, addDoor: true);\n    Room toilet = new Room(name: \"Toilet\", contourPoints: new List<Vector2>() { new Vector2(-8250, 4000), new Vector2(-8250, 5500), new Vector2(-6000, 5500), new Vector2(-6000, 4000) });\n    coridor.ConnectTo(roomToConnect: toilet, withWall: true, addDoor: true);\n    \n    Room bedroom = new Room(name: \"Bedroom\", contourPoints: new List<Vector2>() { new Vector2(-8250, 5500), new Vector2(-8250, 8250), new Vector2(-4500, 8250), new Vector2(-4500, 5500) });\n    coridor.ConnectTo(roomToConnect: bedroom, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { lobby, coridor, livingRoom, kitchen, bedroom, toilet, bathroom });\n    return flat;\n}\n```"}, {"task": "Make a plan of a three-room apartment. The corridor should go after the lobby and be long. The kitchen should be to the left of the lobby and have a door to the lobby. The living room should be located after the kitchen, to the left of the corridor, the entrance to the living room should be from the corridor. After the living room there should be the first bedroom and have an entrance from the corridor. Next to the bedroom at the end of the corridor there should be a toilet and a bathroom. To the right of the bathroom there should be a passage from the corridor to the second bedroom.", "actions": "1. Plan the lobby: You must design a lobby near the entrance that is 2 x 2.4 meters in size, making it spacious enough for easy access and movement within the apartment.\n2. Plan the corridor: After the lobby, you must design a long, L-shape corridor which will serve as the main connection to all rooms, excluding the kitchen. The corridor will be 2 meters wide, allowing sufficient space for comfortable movement and access to the living room, both bedrooms, and the toilet/bathroom.\n3. Plan the kitchen: You must allocate enough space for a kitchen along the lobby, to the left of it. Based on the requirement of at least 8 m2 for the kitchen area, you must create a rectangular kitchen with a length of 5 meters and a width of 2.4 meters. The kitchen must have a door to the lobby, allowing easy access.\n4. Plan the living room: The living room must be located after the kitchen, to the left of the corridor. The entrance to the living room must be from the corridor. You must designate a large living room area of at least 16 m2, as required for a three-room apartment. Create the living room with dimensions of 5 meters long and 3.6 meters wide.\n5. Plan the first bedroom: The first bedroom will be located next to the living room, still to the left of the corridor, with an entrance from the corridor. You must designate a bedroom measuring at least 10 m2, as required for a two-person bedroom. The dimensions of the first bedroom must be 5 meters long and 3 meters wide.\n6. Plan the bathroom and toilet: The toilet and bathroom must remain at the end of the corridor, providing privacy and easy accessibility. The bathroom dimensions must be 2.5 x 2 meters, while the toilet dimensions must be 2 x 1.5 meters.\n7. Plan the second bedroom: The passage from the corridor to the second bedroom must be to the right of the bathroom. The entrance to the second bedroom must be from the passage. Another two-person bedroom must be designed with a minimum size of 10 m2. For the second bedroom, dimensions of 4 meters long and 3 meters wide must be used.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room lobby = new Room(name: \"Lobby\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2400), new Vector2(2000, 2400), new Vector2(2000, 0) });\n    lobby.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(2000, 0), doorRelativePosition: 0.5);\n    \n    Room coridor = new Room(name: \"Corridor\", contourPoints: new List<Vector2>() { new Vector2(0, 2400), new Vector2(0, 7000), new Vector2(4000, 7000), new Vector2(4000, 5000), new Vector2(2000, 5000), new Vector2(2000, 2400) });\n    coridor.ConnectTo(roomToConnect: lobby, withWall: false);\n    \n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(-5000, 0), new Vector2(-5000, 2400), new Vector2(0, 2400), new Vector2(0, 0) });\n    kitchen.ConnectTo(roomToConnect: lobby, withWall: true, addDoor: true);\n    \n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(-5000, 2400), new Vector2(-5000, 6000), new Vector2(0, 6000), new Vector2(0, 2400) });\n    coridor.ConnectTo(roomToConnect: livingRoom, withWall: true, addDoor: true);\n    \n    Room firstBedroom = new Room(name: \"First bedroom\", contourPoints: new List<Vector2>() { new Vector2(-5000, 6000), new Vector2(-5000, 9000), new Vector2(0, 9000), new Vector2(0, 6000) });\n    coridor.ConnectTo(roomToConnect: firstBedroom, withWall: true, addDoor: true);\n    \n    Room bathroom = new Room(name: \"Bathroom\", contourPoints: new List<Vector2>() { new Vector2(0, 7000), new Vector2(0, 9000), new Vector2(2500, 9000), new Vector2(2500, 7000) });\n    coridor.ConnectTo(roomToConnect: bathroom, withWall: true, addDoor: true);\n    Room toilet = new Room(name: \"Toilet\", contourPoints: new List<Vector2>() { new Vector2(2500, 7000), new Vector2(2500, 9000), new Vector2(4000, 9000), new Vector2(4000, 7000) });\n    coridor.ConnectTo(roomToConnect: toilet, withWall: true, addDoor: true);\n    \n    Room secondBedroom = new Room(name: \"Second bedroom\", contourPoints: new List<Vector2>() { new Vector2(4000, 5000), new Vector2(4000, 9000), new Vector2(7000, 9000), new Vector2(7000, 5000) });\n    coridor.ConnectTo(roomToConnect: secondBedroom, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { lobby, coridor, kitchen, livingRoom, firstBedroom, bathroom, toilet, secondBedroom });\n    return flat;\n}\n```"}, {"task": "Make a plan of a two-room apartment. There should be an entrance to a combined bathroom from the lobby. To the left of the lobby there should be a corridor, which should branch off to the left and straight ahead. There should be a passage directly from the corridor to the kitchen, on the left side of the corridor there should be an entrance to the living room and bedroom.", "actions": "1. Plan the lobby: You must design a lobby near the entrance that is 2 x 2 meters in size, making it spacious enough for easy access and movement within the apartment.\n2. Plan the combined bathroom: In this case, the bathroom and toilet will be combined into one space, which will be accessible directly from the lobby. You must allocate a space of 5 m2, ensuring enough space for the necessary fixtures, including a shower, sink, and toilet. You must create the combined bathroom of rectangular shape with a length of 2.5 m and a width of 2 m.\n3. Plan the corridor: After the lobby, you must design a corridor branching off to the left and straight ahead, with a passage directly from the corridor to the kitchen. The corridor must be 2 meters wide, allowing sufficient space for comfortable movement and access to the living room, bedroom, and kitchen. The corridor must be L-shaped, one branch must be directed towards the bedroom to the left, the other towards the kitchen forward. Thus, the corridor must consist of two rectangles: the left one is 4 m long and the front one is 4.5 m long.\n4. Plan the kitchen: you must allocate enough space for a kitchen along the corridor, to the front of the branching corridor. Based on the requirement of at least 8 m2 for the kitchen area, you must create a rectangular kitchen with a length of 4 meters and a width of 2.5 m.\n5. Plan the living room: The living room must be located along the corridor, accessible via an entrance from the corridor. You must designate a large living room area of at least 16 m2, as required for a two-room apartment. You must create the living room with dimensions of 5 meters long and 4 meters wide.\n6. Plan the bedroom: Next to the living room, another entrance from the corridor must lead to the bedroom. The dimensions of the bedroom must be 7 meters long and 3 meters wide, creating an area bigger than 10 m2 to accommodate a two-person bedroom.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room lobby = new Room(name: \"Lobby\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2000), new Vector2(2000, 2000), new Vector2(2000, 0) });\n    lobby.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(2000, 0), doorRelativePosition: 0.5);\n    \n\tRoom bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(0, 2000), new Vector2(0, 4500), new Vector2(2000, 4500), new Vector2(2000, 2000) });\n    bathroom.ConnectTo(roomToConnect: lobby, withWall: true, addDoor: true);\n    \n    Room coridor = new Room(name: \"Corridor\", contourPoints: new List<Vector2>() { new Vector2(-6000, 0), new Vector2(-6000, 2000), new Vector2(-2000, 2000), new Vector2(-2000, 4500), new Vector2(0, 4500), new Vector2(0, 0) });\n    coridor.ConnectTo(roomToConnect: lobby, withWall: false);\n    \n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(-2000, 4500), new Vector2(-2000, 7000), new Vector2(2000, 7000), new Vector2(2000, 4500) });\n    coridor.ConnectTo(roomToConnect: kitchen, withWall: true, addDoor: true);\n    \n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(-6000, 2000), new Vector2(-6000, 7000), new Vector2(-2000, 7000), new Vector2(-2000, 2000) });\n    coridor.ConnectTo(roomToConnect: livingRoom, withWall: true, addDoor: true);\n    \n    Room bedroom = new Room(name: \"Bedroom\", contourPoints: new List<Vector2>() { new Vector2(-9000, 0), new Vector2(-9000, 7000), new Vector2(-6000, 7000), new Vector2(-6000, 0) });\n    coridor.ConnectTo(roomToConnect: bedroom, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { lobby, coridor, bathroom, kitchen, livingRoom, bedroom });\n    return flat;\n}\n```"}, {"task": "Make a one-room apartment. To the left of the lobby there should be a passage to the corridor. From the corridor on the left there should be an entrance to the living room, on the right there should be an entrance to the combined bathroom, in front there should be a passage to the kitchen.", "actions": "1. Plan the lobby: Design a lobby near the entrance that is 2 x 2.5 meters in size, making it spacious enough for easy access and movement within the apartment.\n2. Plan the corridor: To the left of the lobby, create a corridor. The corridor must serve as the main connection to the living room, combined bathroom, and kitchen.\n3. Plan the living room: The living room must be accessible from the left side if the corridor through an entrance. You must designate a large living room area of at least 14 m2, as required for a one-room apartment. You must create the living room with dimensions of 6.5 meters long and 3.5 meters wide.\n4. Plan the combined bathroom: From the corridor, on the right side, allocate enough space for a combined bathroom to accommodate necessary fixtures, including a shower, sink, toilet, and washing machine. The dimensions of the combined bathroom must be 2.5 x 2 meters, ensuring enough space for the aforementioned fixtures.\n5. Plan the kitchen: At the end of the corridor, provide access to the kitchen. Based on the requirement of at least 8 m2 for the kitchen area, you must create a rectangular kitchen with a length of 4 meters and a width of 2.5 meters.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room lobby = new Room(name: \"Lobby\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2000), new Vector2(2500, 2000), new Vector2(2500, 0) });\n    lobby.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(2500, 0), doorRelativePosition: 0.5);\n    \n    Room coridor = new Room(name: \"Corridor\", contourPoints: new List<Vector2>() { new Vector2(-1500, 0), new Vector2(-1500, 4000), new Vector2(0, 4000), new Vector2(0, 0) });\n    coridor.ConnectTo(roomToConnect: lobby, withWall: false);\n\n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(-5000, 0), new Vector2(-5000, 6500), new Vector2(-1500, 6500), new Vector2(-1500, 0) });\n    coridor.ConnectTo(roomToConnect: livingRoom, withWall: true, addDoor: true);\n\n    Room bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(0, 2000), new Vector2(0, 4000), new Vector2(2500, 4000), new Vector2(2500, 2000) });\n    coridor.ConnectTo(roomToConnect: bathroom, withWall: true, addDoor: true);\n    \n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(-1500, 4000), new Vector2(-1500, 6500), new Vector2(2500, 6500), new Vector2(2500, 4000) });\n    coridor.ConnectTo(roomToConnect: kitchen, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { lobby, coridor, bathroom, kitchen, livingRoom });\n    return flat;\n}\n```"}, {"task": "Design a studio apartment. Let there be a small hallway, next to which there will be a combined bathroom. From the hallway there will be an exit to the main space of the apartment, where the kitchen area and the living room area will be located.", "actions": "1. Place the hallway. The hallway should be at the entrance to the apartment, so put the front door in the hallway. On the apartment plan, the hallway should be on top. The hallway should be small, but have enough space for changing clothes, so make the hallway rectangular with dimensions in the plan of 1.61 by 2 m.\n2. Place the combined bathroom. The combined bathroom should have a bathtub, toilet and sink, so the room should have enough space. At the same time, the bathroom should be compact, since the designed apartment has a small area. Make a combined bathroom with dimensions of 1.85 by 1.61 m and place it in the plan to the left of the hallway. Be sure to make a door from the hallway to the bathroom so that residents can get there.\n3. Design the living room and kitchen area. According to the requirement of the state code of rules for the design of residential buildings, the minimum area of ​​a common living room in a one-room apartment is 14 m2. In order for our apartment to meet this requirement, make a common room with dimensions of 5.39 m by 3.85 m, then the area will be equal to 20.75 m.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room hallway = new Room(name: \"Hallway\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 1610), new Vector2(2000, 1610), new Vector2(2000, 0) });\n    lobby.AddDoorBetween(firstPoint: new Vector2(0, 1610), secondPoint: new Vector2(2000, 1610), doorRelativePosition: 0.5);\n\n    Room bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(-1850, 0), new Vector2(-1850, 1610), new Vector2(0, 1610), new Vector2(0, 0) });\n    bathroom.ConnectTo(roomToConnect: lobby, withWall: true, addDoor: true);\n\n    Room livingKitchen = new Room(name: \"Living Room and Kitchen\", contourPoints: new List<Vector2>() { new Vector2(-1850, 0), new Vector2(2000, 0), new Vector2(2000, -5390), new Vector2(-1850, -5390) });\n    livingKitchen.ConnectTo(roomToConnect: lobby, withWall: false);\n\n    Flat flat = new Flat(new List<Room> { lobby, bathroom, livingKitchen });\n    return flat;\n}\n```"}, {"task": "Make a studio apartment with an area not exceeding 29 m2. Make a set of rooms, as in a regular studio apartment - an entrance hall with an adjoining bathroom, an exit from the entrance hall to the common space of the kitchen-living room. Add a loggia, make an exit to the loggia from the kitchen.", "actions": "1. Place the hallway. Make a rectangular hallway measuring 2.2 m by 2.28 m. Place the hallway in the lower right corner of the apartment plan.\n2. Place the combined bathroom. Make a combined bathroom of medium size for the convenience of placing all the necessary devices. Let it be rectangular with dimensions in the plan of 2.6 m by 2.28 m. Place it to the left of the hallway and be sure to connect the hallway and the bathroom with a door.\n3. Design the living room space. According to the requirements of the codes of practice that must be followed, the minimum area of the common living room in a one-room apartment is 14 m2. Since the area of the common room will also include the kitchen area with a minimum area of 5 m2, the area of the living room area should be at least 9 m2. Make the living room 3 m by 3.52 m, then its area will be 10.56 m2. Place the living room right after the hallway, and make a smooth transition from the hallway to the living room - there should be no wall between these rooms.\n4. Arrange the kitchen space. According to the requirements of the codes of practice, the area of ​​the kitchen zone should be at least 5 m2. Make the kitchen rectangular with dimensions of 2.6 m by 2.24 m, then its area will be 5.824 m. Arrange the kitchen so that it makes up a common space with the living room, but stands out on the plan as a separate room. To achieve this effect, place the kitchen to the right of the living room, while removing the wall between them. Thus, the kitchen will be located above the bathroom in the plan.\n5. Design a loggia. Make a loggia measuring 2.6 m by 1.28 m. Place the loggia next to the kitchen and make a door from the kitchen to the loggia. On the plan, the loggia should be located above the kitchen.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room hallway = new Room(name: \"Hallway\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2280), new Vector2(2200, 2280), new Vector2(2200, 0) });\n    hallway.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(2200, 0), doorRelativePosition: 0.5);\n\n    Room bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(-2600, 0), new Vector2(-2600, 2280), new Vector2(0, 2280), new Vector2(0, 0) });\n    bathroom.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room livingRoom = new Room(name: \"Living Room\", contourPoints: new List<Vector2>() { new Vector2(0, 2280), new Vector2(0, 5800), new Vector2(3000, 5800), new Vector2(3000, 2280) });\n    livingRoom.ConnectTo(roomToConnect: hallway, withWall: false);\n\n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(-2600, 2280), new Vector2(-2600, 4520), new Vector2(0, 4520), new Vector2(0, 2280) });\n    kitchen.ConnectTo(roomToConnect: livingRoom, withWall: false);\n\n    Room loggia = new Room(name: \"Loggia\", contourPoints: new List<Vector2>() { new Vector2(-2600, 4520), new Vector2(-2600, 5800), new Vector2(0, 5800), new Vector2(0, 4520) });\n    kitchen.ConnectTo(roomToConnect: loggia, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { hallway, bathroom, livingRoom, kitchen, loggia });\n    return flat;\n}\n```"}, {"task": "Design a one-room apartment with a kitchen-living room, with an area of at least 17 m2. The apartment should have a separate bedroom with its own wardrobe, which can only be accessed from the bedroom. Make a combined bathroom with an exit from the hallway. Also make a separate wardrobe in the hallway and an exit to the kitchen-living room. The entrance to the bedroom should be from the kitchen-living room.", "actions": "1. Design the hallway. Make a hallway with a separate cloakroom area. The cloakroom area should be 1.2 m by 2.75 m, while the remaining hallway area should be 1.1 m by 2.05 m. Place the hallway with a cloakroom at the top of the apartment plan.\n2. Place the bathroom. The bathroom should be combined and have enough space for a bathtub, toilet and sink. Make the bathroom rectangular with dimensions in the plan of 2.1 m by 2.05 m. Place the bathroom at the top of the apartment plan to the right of the hallway.\n3. Design a kitchen-living room. According to the requirements of the codes of practice, the minimum area of the common living room in a one-room apartment is 14 m2. Therefore, make a kitchen-living room measuring 3.2 m by 5.4 m, then its area will be 17.28 m. Place the kitchen-living room next to the hallway, on the apartment plan it should be located under the hallway. Make a smooth transition from the hallway to the living room - there should be no wall between them.\n4. Design a bedroom. According to the requirements of the codes of practice, the area of a bedroom for two people should be at least 10 m2. Since the apartment has one bedroom, two people will sleep in it at once, so the area of the bedroom in the apartment should be at least 10 m2. Make a bedroom measuring 4.7 m by 3.2 m, while \"cutting off\" the corner of the bedroom to make room for a private wardrobe.\n5. Add a private wardrobe. In the corner \"cut off\" from the bedroom, place a small private wardrobe, measuring 1.95 m by 2 m.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room hallway = new Room(name: \"Hallway\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2050), new Vector2(1100, 2050), new Vector2(1100, 0) });\n    hallway.AddDoorBetween(firstPoint: new Vector2(0, 2050), secondPoint: new Vector2(1100, 2050), doorRelativePosition: 0.5);\n\n    Room cloackroom = new Room(name: \"Cloackroom\", contourPoints: new List<Vector2>() { new Vector2(-1200, -700), new Vector2(-1200, 2050), new Vector2(0, 2050), new Vector2(0, -700) });\n    cloackroom.ConnectTo(roomToConnect: hallway, withWall: false);\n\n    Room bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(1100, 0), new Vector2(1100, 2050), new Vector2(3200, 2050), new Vector2(3200, 0) });\n    bathroom.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room livingKitchen = new Room(name: \"Living Room and Kitchen\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(3200, 0), new Vector2(3200, -5400), new Vector2(0, -5400) });\n    livingKitchen.ConnectTo(roomToConnect: hallway, withWall: false);\n\n    Room bedroom = new Room(name: \"Bedroom\", contourPoints: new List<Vector2>() { new Vector2(-1200, -700), new Vector2(0, -700), new Vector2(0, -5400), new Vector2(-3200, -5400), new Vector2(-3200, -1950), new Vector2(-1200, -1950) });\n    bedroom.ConnectTo(roomToConnect: livingKitchen, withWall: true, addDoor: true);\n\n    Room wardrobe = new Room(name: \"Wardrobe\", contourPoints: new List<Vector2>() { new Vector2(-3200, -1950), new Vector2(-3200, 0), new Vector2(-1200, 0), new Vector2(-1200, -1950) });\n    bedroom.ConnectTo(roomToConnect: wardrobe, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { hallway, cloackroom, bathroom, livingKitchen, bedroom, wardrobe });\n    return flat;\n}\n```"}, {"task": "Design a one-room apartment with a loggia. The apartment should have a separate room for a wardrobe. The kitchen and living room should be separate. The kitchen area should be more than 10 m2. The hallway should have doors to the wardrobe, bathroom, living room and kitchen. The entrance to the loggia should be from the kitchen.", "actions": "1. Place the hallway. The hallway should be large, because it will have access to the wardrobe, bathroom, kitchen and living room. Make the hallway rectangular with dimensions of 2.82 by 2.3 m. Place the hallway at the top of the apartment plan.\n2. Add a wardrobe. Place it to the left of the hallway on the apartment plan. Make the wardrobe rectangular in plan with dimensions of 2.3 m by 1.92 m. Connect the wardrobe with a door to the hallway.\n3. Design a combined bathroom. Make a rectangular bathroom with dimensions of 2.3 m by 2.13 m. Place the bathroom to the right of the hallway in the plan. Be sure to connect the bathroom with the hallway by adding a door between them.\n4. Place the living room. According to the requirements of the codes, the minimum area of ​​the living room in a one-room apartment is 14 m2. Make the living room 3.3 m by 4.7 m. Place the living room next to the hallway, make a door from the hallway to the living room. On the plan, the living room should be located under the hallway.\n5. Place the kitchen. According to the requirements of the codes, the area of ​​​​a separate kitchen should be at least 8 m2. Make a rectangular kitchen with dimensions of 3.57 m by 3.07 m. On the plan, the kitchen should be located to the right of the living room and below the hallway. Make an entrance to the kitchen from the hallway, placing a door between them.\n6. Add a loggia. Make a loggia with dimensions of 3.57 m by 1.63 m. Place the loggia under the kitchen on the plan, it should be to the right of the living room. Make a door between the kitchen and the loggia.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room hallway = new Room(name: \"Hallway\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2300), new Vector2(2820, 2300), new Vector2(2820, 0) });\n    hallway.AddDoorBetween(firstPoint: new Vector2(0, 2300), secondPoint: new Vector2(2820, 2300), doorRelativePosition: 0.5);\n\n    Room wardrobe = new Room(name: \"Wardrobe\", contourPoints: new List<Vector2>() { new Vector2(-1920, 0), new Vector2(-1920, 2300), new Vector2(0, 2300), new Vector2(0, 0) });\n    wardrobe.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room bathroom = new Room(name: \"Combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(2820, 0), new Vector2(2820, 2300), new Vector2(4950, 2300), new Vector2(4950, 0) });\n    bathroom.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(-1920, 0), new Vector2(1380, 0), new Vector2(1380, -4700), new Vector2(-1920, -4700) });\n    livingRoom.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(1380, 0), new Vector2(4950, 0), new Vector2(4950, -3070), new Vector2(1380, -3070) });\n    kitchen.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room loggia = new Room(name: \"Loggia\", contourPoints: new List<Vector2>() { new Vector2(1380, -3070), new Vector2(4950, -3070), new Vector2(4950, -4700), new Vector2(1380, -4700) });\n    loggia.ConnectTo(roomToConnect: kitchen, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { hallway, wardrobe, bathroom, livingRoom, kitchen, loggia });\n    return flat;\n}\n```"}, {"task": "Design a two-room apartment with a kitchen-living room. Make two wardrobes, one of which is a guest one, with an entrance from the hallway, and the other is private, with an entrance from the bedroom. Make two bathrooms, one of which is a guest one, with an entrance from the hallway, and the other is private, with an entrance from the private wardrobe. Make the entrance to the bedroom from the living room.", "actions": "1. Place the hallway. The hallway should accommodate the entrances to the wardrobe, toilet, and kitchen, so make it 1.94 by 2.87 m. Place the hallway in the lower left corner of the apartment plan. Don't forget to add the entrance to the apartment.\n2. Add a guest wardrobe. The guest wardrobe should be located next to the hallway, and there should be space left for the guest toilet. Make a wardrobe measuring 1.52 m by 3.71 m. Place the guest wardrobe to the right of the hallway. Add a door between the wardrobe and the hallway.\n3. Make a guest toilet. The entrance to the guest toilet should be from the hallway, so the toilet should be next to the hallway. Make a guest toilet measuring 1.35 m by 3.71 m. Place the toilet to the right of the hallway in the plan, it should be above the guest wardrobe. Make a door from the hallway to the toilet.\n4. Place the kitchen. According to the requirements of the codes, the area of the kitchen should be at least 8 m2. Make a long rectangular kitchen measuring 4.43 by 1.94 m. Place the kitchen immediately after the hallway, in the plan the kitchen should be above the hallway. Make a smooth transition from the hallway to the kitchen, remove the wall between them.\n5. Add a living room. The living room should form a single space with the kitchen, so place the living room to the right of the kitchen and remove the wall between them. The living room should be located above the guest toilet in the plan. According to the requirements of the codes, the minimum area of the common living room in a two-room apartment is 16 m2, so make the living room rectangular in plan with dimensions of 4.43 m by 3.71 m.\n6. Design a bedroom for two people. According to the requirements of regulatory documents, the area of a bedroom for two people should be more than 10 m2. Make a rectangular bedroom measuring 4.43 m by 3.2 m, then its area will be 14.176 m2. Place the bedroom to the right of the living room in the plan. Make a door from the living room to the bedroom.\n7. Add a private wardrobe. Next to the bedroom, make a private wardrobe, measuring 2.87 m by 1.49 m. Place it below the bedroom in the plan and add a door from the bedroom.\n8. Make a private bathroom. The private bathroom must be combined, because the apartment must have at least one bathtub. The combined bathroom must have enough area to accommodate a bathtub, toilet and sink. The bathroom should be located between the guest bathroom and the private wardrobe in the plan, so it can be a maximum of 1.71 m wide. Make it rectangular with dimensions of 1.71 m by 2.87 m and make an entrance to it from the wardrobe through a door.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room hallway = new Room(name: \"Hallway\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 2870), new Vector2(1940, 2870), new Vector2(1940, 0) });\n    hallway.AddDoorBetween(firstPoint: new Vector2(0, 0), secondPoint: new Vector2(1940, 0), doorRelativePosition: 0.5);\n\n    Room guestWardrobe = new Room(name: \"Guest wardrobe\", contourPoints: new List<Vector2>() { new Vector2(1940, 0), new Vector2(1940, 1520), new Vector2(5650, 1520), new Vector2(5650, 0) });\n    guestWardrobe.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room guestToilet = new Room(name: \"Guest toilet\", contourPoints: new List<Vector2>() { new Vector2(1940, 1520), new Vector2(1940, 2870), new Vector2(5650, 2870), new Vector2(5650, 1520) });\n    guestToilet.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(0, 2870), new Vector2(0, 7300), new Vector2(1940, 7300), new Vector2(1940, 2870) });\n    kitchen.ConnectTo(roomToConnect: hallway, withWall: false);\n\n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(1940, 2870), new Vector2(1940, 7300), new Vector2(5650, 7300), new Vector2(5650, 2870) });\n    livingRoom.ConnectTo(roomToConnect: kitchen, withWall: false);\n\n    Room bedroom = new Room(name: \"Bedroom\", contourPoints: new List<Vector2>() { new Vector2(5650, 2870), new Vector2(5650, 7300), new Vector2(8850, 7300), new Vector2(8850, 2870) });\n    bedroom.ConnectTo(roomToConnect: livingRoom, withWall: true, addDoor: true);\n\n    Room privateWardrobe = new Room(name: \"Private wardrobe\", contourPoints: new List<Vector2>() { new Vector2(7360, 0), new Vector2(7360, 2870), new Vector2(8850, 2870), new Vector2(8850, 0) });\n    bedroom.ConnectTo(roomToConnect: privateWardrobe, withWall: true, addDoor: true);\n\n    Room privateBathroom = new Room(name: \"Private combined bathroom\", contourPoints: new List<Vector2>() { new Vector2(5650, 0), new Vector2(5650, 2870), new Vector2(7360, 2870), new Vector2(7360, 0) });\n    privateWardrobe.ConnectTo(roomToConnect: privateBathroom, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { hallway, guestWardrobe, guestToilet, livingRoom, kitchen, bedroom, privateWardrobe, privateBathroom });\n    return flat;\n}\n```"}, {"task": "Design a three-room apartment with a large living room, over 20 m2. Make a small kitchen adjacent to the living room. The apartment should have a children's room and a bedroom. Next to the bedroom, make a private wardrobe and bathroom, which will only be accessible from the bedroom. Next to the hallway, make a wardrobe, separated from the hallway by a door. From the hallway, make an exit to the living room. From the living room, there should be a corridor that connects the bedroom and children's room with the living room. In the corridor, place a guest bathroom.", "actions": "1. Place the hallway. Make the hallway small, because the dressing room will be allocated in the wardrobe. Make the hallway 1.2 m by 1.9 m. Place it at the top of the apartment plan.\n2. Add a wardrobe. Next to the hallway there should be a guest wardrobe, which should have enough space for a large amount of clothes, since a three-room apartment is designed for a large number of people. Make a wardrobe 2.3 m by 1.9 m. Place it to the left of the hallway and connect it with it with a door.\n3. Place the living room. The living room should be located immediately after the hallway, so place it close to the hallway on the apartment plan. According to the requirements of the codes of practice, the minimum area of the living room in an apartment with 2 or more rooms is 16 m2. According to the customer's requirements, the area of the living room should be at least 20 m2. Make a rectangular living room measuring 5.65 m by 3.88 m. Remove the wall between the hallway and the living room to create a passage between them.\n4. Place the kitchen. According to the requirements of the codes, the minimum area of the kitchen is 8 m2. Make the kitchen 2.68 m by 1.9 m. The kitchen should be adjacent to the living room, there should be no wall between the kitchen and the living room. Place the kitchen in the plan so that it is above the living room and to the right of the hallway.\n5. Add a corridor. To create a passage between the rooms, it is necessary to make a corridor. According to the customer's requirements, the corridor should begin in the living room. Make the corridor 4.12 m long and 1.2 m wide. Place the corridor so that it begins at the top of the living room and continues to the left. The corridor should be under the guest wardrobe.\n6. Make a nursery. According to the customer's requirements, the nursery should be spacious. Make a nursery measuring 4.12 m by 4.45 m. Place the nursery so that it is under the corridor and to the left of the living room on the plan. Make an entrance to the room from the corridor, put a door.\n7. Add a guest bathroom. The bathroom should be combined, so you need to provide enough space for a bathtub, toilet and sink. Make a bathroom measuring 1.9 by 3.02 m. Place the bathroom so that it is above the corridor and to the left of the guest wardrobe on the plan. Make an entrance to the bathroom from the corridor through a door.\n8. Make a bedroom. The bedroom should provide for the location of a private wardrobe nearby, so the bedroom must be made L-shaped. Make an L-shaped bedroom with maximum dimensions of 5.65 m by 3.32 m. In the corner of the bedroom, make a cutout for a wardrobe measuring 2.12 m by 1.77 m. Place the bedroom at the left end of the corridor so that the corridor ends there. The bedroom should be located so that there is a nursery to the right of it. Make a passage to the bedroom from the corridor, put a door.\n9. Place a private wardrobe. In the empty space near the bedroom, there should be a wardrobe that will be accessible only from the bedroom. Make a wardrobe measuring 2.12 m by 1.97 m and add a door for entry into it from the bedroom.\n10. Add a private bathroom. The private bathroom should be accessible only from the bedroom through the private wardrobe. Make a bathroom measuring 1.7 m by 2.12 m and place it so that in the plan it is above the private wardrobe and to the left of the guest bathroom. Make an entrance to it from the private wardrobe through a door.", "solution": "```csharp\npublic Flat DesignFlat()\n{\n    Room hallway = new Room(name: \"Hallway\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, 1900), new Vector2(1200, 1900), new Vector2(1200, 0) });\n    hallway.AddDoorBetween(firstPoint: new Vector2(0, 1900), secondPoint: new Vector2(1200, 1900), doorRelativePosition: 0.5);\n\n    Room guestWardrobe = new Room(name: \"Guest wardrobe\", contourPoints: new List<Vector2>() { new Vector2(-2300, 0), new Vector2(-2300, 1900), new Vector2(0, 1900), new Vector2(0, 0) });\n    guestWardrobe.ConnectTo(roomToConnect: hallway, withWall: true, addDoor: true);\n\n    Room livingRoom = new Room(name: \"Living room\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(3880, 0), new Vector2(3880, -5650), new Vector2(0, -5650) });\n    livingRoom.ConnectTo(roomToConnect: hallway, withWall: false);\n\n    Room kitchen = new Room(name: \"Kitchen\", contourPoints: new List<Vector2>() { new Vector2(1200, 0), new Vector2(1200, 1900), new Vector2(3880, 1900), new Vector2(3880, 0) });\n    kitchen.ConnectTo(roomToConnect: livingRoom, withWall: false);\n\n    Room corridor = new Room(name: \"Corridor\", contourPoints: new List<Vector2>() { new Vector2(0, 0), new Vector2(0, -1200), new Vector2(-4120, -1200), new Vector2(-4120, 0) });\n    corridor.ConnectTo(roomToConnect: livingRoom, withWall: false);\n\n    Room nursery = new Room(name: \"Nursery\", contourPoints: new List<Vector2>() { new Vector2(-4120, -1200), new Vector2(0, -1200), new Vector2(0, -5650), new Vector2(-4120, -5650) });\n    nursery.ConnectTo(roomToConnect: corridor, withWall: true, addDoor: true);\n\n    Room guestBathroom = new Room(name: \"Guest bathroom\", contourPoints: new List<Vector2>() { new Vector2(-5320, 0), new Vector2(-5320, 1900), new Vector2(-2300, 1900), new Vector2(-2300, 0) });\n    guestBathroom.ConnectTo(roomToConnect: corridor, withWall: true, addDoor: true);\n\n    Room bedroom = new Room(name: \"Bedroom\", contourPoints: new List<Vector2>() { new Vector2(-5320, 0), new Vector2(-4120, 0), new Vector2(-4120, -5650), new Vector2(-7440, -5650), new Vector2(-7440, -1770), new Vector2(-5320, -1770) });\n    bedroom.ConnectTo(roomToConnect: corridor, withWall: true, addDoor: true);\n\n    Room privateWardrobe = new Room(name: \"Private wardrobe\", contourPoints: new List<Vector2>() { new Vector2(-7440, -1770), new Vector2(-7440, 200), new Vector2(-5320, 200), new Vector2(-5320, -1770) });\n    bedroom.ConnectTo(roomToConnect: privateWardrobe, withWall: true, addDoor: true);\n\n    Room privateBathroom = new Room(name: \"Private bathroom\", contourPoints: new List<Vector2>() { new Vector2(-7440, 200), new Vector2(-7440, 1900), new Vector2(-5320, 1900), new Vector2(-5320, 200) });\n    privateBathroom.ConnectTo(roomToConnect: privateWardrobe, withWall: true, addDoor: true);\n\n    Flat flat = new Flat(new List<Room> { hallway, guestWardrobe, livingRoom, kitchen, corridor, nursery, guestBathroom, bedroom, privateWardrobe, privateBathroom });\n    return flat;\n}\n```"}]